| A Javascript Bootstrat Devops | Semantic-release | TDD                   |
| Microlibrary                  | Community Driven | Reproducable Research |
* Npm Setup
** Configure NPM
#+BEGIN_SRC sh :var EMAIL="chowdhury.k.ashraf@gmail.com" URL=""
  npm set init-author-email $EMAIL
  npm set init-author-url $URL
  npm set init-license=MIT
  npm set save-exact true
  echo $EMAIL $URL
#+END_SRC

** [[~/.npmrc][npm rc]] for npm setting
** Add npm user ( if you don't have npm account )
#+NAME: npm-adduser
#+BEGIN_EXAMPLE
npm adduser
#+END_EXAMPLE

#+CALL: cmdaync(npm-adduser)

** npm init
*** Check NPM Version
#+BEGIN_SRC sh :results verbatim drawer
npm version
#+END_SRC
*** init cmd
#+NAME: npm-init
#+BEGIN_EXAMPLE
npm init
#+END_EXAMPLE

#+CALL: cmdaync(npm-init)

#+RESULTS:
: command  is sended to /tmp/friends-aneesha

*** [[./package.json][package]]
* init module
** Module firend_anneesha
*** Install Dependencies
#+BEGIN_SRC sh :resutls verbatim drawer
npm install unique-random-array
#+END_SRC

#+RESULTS:

*** Write module [[./src/index.js][module src]]
#+BEGIN_SRC js :tangle src/index.js :mkdirp yes
var uniqueRandomArray = require('unique-random-array');
var starWarsNames = require('./friends-names.json');

module.exports = {
  all: starWarsNames,
  random: uniqueRandomArray(starWarsNames)
};
#+END_SRC
** data init
#+BEGIN_SRC js :tangle src/friends-names.json
[
  "Aneesha",
  "Ghumpori",
  "Maliha",
  "Shamaila",
  "Liana",
  "Asia",
  "Arjab",
  "Esha",
  "Rumaita",
  "Faiz",
  "Aiyan"
]
#+END_SRC

** import library
#+BEGIN_SRC js :cmd "babel-node" :tangle repl/friends-names.js :results output drawer :mkdirp yes
  let lib = require(process.cwd() + '/src/index.js');
  console.log('|random friend | ' + lib.random());
  console.log('|list of friends| ' + lib.all);
#+END_SRC

#+RESULTS:
:RESULTS:
| random friend   | Arjab                                                                     |
| list of friends | Aneesha,Ghumpori,Maliha,Shamaila,Liana,Asia,Arjab,Esha,Rumaita,Faiz,Aiyan |
:END:

* Setup GIT
#+call: readme()

#+name: thisproject
#+call: giturl("chowdhuryashraf", module[0])

#+call: gitinit(thisproject[0])

* Npm publish
** Publish to npm
   CLOCK: [2016-01-13 Wed 15:04]--[2016-01-13 Wed 15:05] =>  0:01
#+BEGIN_SRC sh
npm publish
#+END_SRC

#+RESULTS:
: + friends-aneesha@1.0.0
** Check details
#+BEGIN_SRC sh :results output
npm info friends-aneesha
#+END_SRC

#+RESULTS:
#+begin_example

{ name: 'friends-aneesha',
  description: 'New Module bootstrap',
  'dist-tags': { latest: '1.0.0' },
  versions: [ '1.0.0' ],
  maintainers: [ 'chowdhuryashraf <chowdhury.k.ashraf@gmail.com>' ],
  time:
   { modified: '2016-01-13T19:24:52.189Z',
     created: '2016-01-13T19:24:52.189Z',
     '1.0.0': '2016-01-13T19:24:52.189Z' },
  homepage: 'https://github.com/chowdhuryashraf/friends-aneesha#readme',
  keywords: [ 'bootstart', 'module' ],
  repository:
   { type: 'git',
     url: 'git+https://github.com/chowdhuryashraf/friends-aneesha.git' },
  author: 'Chowdhury Ashraf',
  bugs: { url: 'https://github.com/chowdhuryashraf/friends-aneesha/issues' },
  license: 'MIT',
  readmeFilename: 'README.md',
  version: '1.0.0',
  main: 'src/index.js',
  dependencies: { 'unique-random-array': '1.0.0' },
  devDependencies: {},
  scripts: { test: 'echo "Error: no test specified" && exit 1' },
  gitHead: '40e950b9d7a1cf1905ef0b028d46f940c35fcbfb',
  dist:
   { shasum: 'afeae752a81af64401436d7d250996d3ce3e9a96',
     tarball: 'http://registry.npmjs.org/friends-aneesha/-/friends-aneesha-1.0.0.tgz' },
  directories: {} }

#+end_example

** Deploy other place
   CLOCK: [2016-01-13 Wed 14:39]--[2016-01-13 Wed 15:04] =>  0:25
   :PROPERTIES:
   :Effort:   0:05
   :dir: /usr/local/src/microlibrary/testmicro
   :END:

#+BEGIN_SRC sh
npm install friends-aneesha
#+END_SRC

#+RESULTS:
| /usr/local/src/microlibrary/testmicro |                           |
| └─┬                                   | friends-aneesha@1.0.0     |
| └─┬                                   | unique-random-array@1.0.0 |
| └──                                   | unique-random@1.0.0       |
|                                       |                           |
#+NAME: mpath
#+BEGIN_SRC elisp
(expand-file-name "node_modules/")
#+END_SRC

#+RESULTS:
: /usr/local/src/microlibrary/testmicro/node_modules/

#+BEGIN_SRC js :cmd "babel-node" :var path=mpath[0]   :results output drawer
let friendsAneesha = require(path + 'friends-aneesha')
console.log(friendsAneesha.all);
console.log(friendsAneesha.random());
console.log(friendsAneesha.random());
console.log(friendsAneesha.random());
console.log(friendsAneesha.random());
#+END_SRC

#+RESULTS:
:RESULTS:
[ 'Aneesha',
  'Ghumpori',
  'Maliha',
  'Shamaila',
  'Liana',
  'Asia',
  'Arjab',
  'Esha',
  'Rumaita',
  'Faiz',
  'Aiyan' ]
Liana
Shamaila
Aneesha
Maliha
:END:

* Publishing a beta version
** Adding 2 names in aneesha's [[/usr/local/src/microlibrary/friends-aneesha/src/friends-names.json][friend list]]
#+BEGIN_EXAMPLE
@@ -1,4 +1,3 @@
-
 [
   "Aneesha",
   "Ghumpori",
@@ -10,5 +9,7 @@
   "Esha",
   "Rumaita",
   "Faiz",
-  "Aiyan"
+  "Aiyan",
+  "Baby Baby2",
+  "Bandhan"
 ]

#+END_EXAMPLE
** Update Git Tag
#+CALL: gittag("1.4.0-beta.0")

#+RESULTS:
: nil

** package.json
#+BEGIN_EXAMPLE
modified   package.json
@@ -1,6 +1,6 @@
 {
   "name": "friends-aneesha",
-  "version": "1.0.0",
+  "version": "1.4.0-beta.0",
#+END_EXAMPLE
** Publish Beta release to Npm
#+BEGIN_SRC sh
npm publish --tag beta
#+END_SRC

#+RESULTS:
: + friends-aneesha@1.4.0-beta.0
*** Get info
#+BEGIN_SRC sh :results replace output
npm info
#+END_SRC

#+RESULTS:
#+begin_example

{ name: 'friends-aneesha',
  description: 'New Module bootstrap',
  'dist-tags': { latest: '1.0.0', beta: '1.4.0-beta.0' },
  versions: [ '1.0.0', '1.4.0-beta.0' ],
  maintainers: [ 'chowdhuryashraf <chowdhury.k.ashraf@gmail.com>' ],
  time:
   { modified: '2016-01-17T21:39:15.651Z',
     created: '2016-01-13T19:24:52.189Z',
     '1.0.0': '2016-01-13T19:24:52.189Z',
     '1.4.0-beta.0': '2016-01-17T21:39:15.651Z' },
  homepage: 'https://github.com/chowdhuryashraf/friends-aneesha#readme',
  keywords: [ 'bootstart', 'module' ],
  repository:
   { type: 'git',
     url: 'git+https://github.com/chowdhuryashraf/friends-aneesha.git' },
  author: 'Chowdhury Ashraf',
  bugs: { url: 'https://github.com/chowdhuryashraf/friends-aneesha/issues' },
  license: 'MIT',
  readmeFilename: 'README.md',
  version: '1.0.0',
  main: 'src/index.js',
  dependencies: { 'unique-random-array': '1.0.0' },
  devDependencies: {},
  scripts: { test: 'echo "Error: no test specified" && exit 1' },
  gitHead: '40e950b9d7a1cf1905ef0b028d46f940c35fcbfb',
  dist:
   { shasum: 'afeae752a81af64401436d7d250996d3ce3e9a96',
     tarball: 'http://registry.npmjs.org/friends-aneesha/-/friends-aneesha-1.0.0.tgz' },
  directories: {} }

#+end_example

** Deploy other place
   CLOCK: [2016-01-13 Wed 14:39]--[2016-01-13 Wed 15:04] =>  0:25
   :PROPERTIES:
   :Effort:   0:05
   :dir: /usr/local/src/microlibrary/testmicro
   :END:

#+BEGIN_SRC sh
npm install friends-aneesha@beta
#+END_SRC

#+RESULTS:
| /usr/local/src/microlibrary/testmicro |                              |
| └──                                   | friends-aneesha@1.4.0-beta.0 |
|                                       |                              |
#+NAME: mpath
#+BEGIN_SRC elisp
(expand-file-name "node_modules/")
#+END_SRC

#+RESULTS:
: /usr/local/src/microlibrary/testmicro/node_modules/

#+BEGIN_SRC js :cmd "babel-node" :var path=mpath[0]   :results output drawer
let friendsAneesha = require(path + 'friends-aneesha')
console.log(friendsAneesha.all);
console.log(friendsAneesha.random());
console.log(friendsAneesha.random());
console.log(friendsAneesha.random());
console.log(friendsAneesha.random());
#+END_SRC

#+RESULTS:
:RESULTS:
[ 'Aneesha',
  'Ghumpori',
  'Maliha',
  'Shamaila',
  'Liana',
  'Asia',
  'Arjab',
  'Esha',
  'Rumaita',
  'Faiz',
  'Aiyan',
  'Baby Baby2',
  'Bandhan' ]
Rumaita
Maliha
Arjab
Esha
:END:
** Test friends-aneesha@1.4.0-beta.0
*** Adding test libraries mocha chai
#+BEGIN_SRC sh
npm install --save-dev mocha
#+END_SRC

#+BEGIN_SRC sh
npm install --save-dev chai
#+END_SRC

#+RESULTS:
| friends-aneesha@1.4.0-beta.0 | /usr/local/src/microlibrary/friends-aneesha |                       |                   |
| ├─┬                          | chai@3.4.1                                  |                       |                   |
| │                            | ├──                                         | assertion-error@1.0.1 |                   |
| │                            | ├─┬                                         | deep-eql@0.1.3        |                   |
| │                            | │                                           | └──                   | type-detect@0.1.1 |
| │                            | └──                                         | type-detect@1.0.0     |                   |
| └──                          | unique-random-array@1.0.0                   |                       |                   |
|                              |                                             |                       |                   |

#+BEGIN_SRC sh
npm list mocha chi
#+END_SRC

#+RESULTS:
| friends-aneesha@1.4.0-beta.0 | /usr/local/src/microlibrary/friends-aneesha |
| ├──                          | chi@0.0.10                                  |
| └──                          | mocha@2.3.4                                 |
|                              |                                             |

#+BEGIN_SRC sh
npm list
#+END_SRC

#+RESULTS:
| friends-aneesha@1.4.0-beta.0 | /usr/local/src/microlibrary/friends-aneesha |                            |                   |
| ├─┬                          | chai@3.4.1                                  |                            |                   |
| │                            | ├──                                         | assertion-error@1.0.1      |                   |
| │                            | ├─┬                                         | deep-eql@0.1.3             |                   |
| │                            | │                                           | └──                        | type-detect@0.1.1 |
| │                            | └──                                         | type-detect@1.0.0          |                   |
| ├─┬                          | mocha@2.3.4                                 |                            |                   |
| │                            | ├──                                         | commander@2.3.0            |                   |
| │                            | ├─┬                                         | debug@2.2.0                |                   |
| │                            | │                                           | └──                        | ms@0.7.1          |
| │                            | ├──                                         | diff@1.4.0                 |                   |
| │                            | ├──                                         | escape-string-regexp@1.0.2 |                   |
| │                            | ├─┬                                         | glob@3.2.3                 |                   |
| │                            | │                                           | ├──                        | graceful-fs@2.0.3 |
| │                            | │                                           | ├──                        | inherits@2.0.1    |
| │                            | │                                           | └─┬                        | minimatch@0.2.14  |
| │                            | │                                           | ├──                        | lru-cache@2.7.3   |
| │                            | │                                           | └──                        | sigmund@1.0.1     |
| │                            | ├──                                         | growl@1.8.1                |                   |
| │                            | ├─┬                                         | jade@0.26.3                |                   |
| │                            | │                                           | ├──                        | commander@0.6.1   |
| │                            | │                                           | └──                        | mkdirp@0.3.0      |
| │                            | ├─┬                                         | mkdirp@0.5.0               |                   |
| │                            | │                                           | └──                        | minimist@0.0.8    |
| │                            | └──                                         | supports-color@1.2.0       |                   |
| └─┬                          | unique-random-array@1.0.0                   |                            |                   |
| └──                          | unique-random@1.0.0                         |                            |                   |
|                              |                                             |                            |                   |
*** wrote [[file:src/index.test.js][test module]]
#+NAME: test_friends
#+BEGIN_SRC js
var expect = require('chai').expect;
var friends = require('./index');

describe('firends-anneesha', function() {
  describe('all', function() {
    it('should be an array of strings', function() {
      expect(friends.all).to.satisfy(isArrayOfStrings);

      function isArrayOfStrings(array) {
        return array.every(function(item) {
           return typeof item === 'string';
        });
      }
    });
    it('should contain `bandhan`', function() {
      expect(friends.all).to.include('Bandhan');
    });
  });
  describe('random', function() {
    it('should return a random item from the starWars.all', function() {
      var randomItem = friends.random();
      expect(friends.all).to.include(randomItem);
    });
  });
});
#+END_SRC

* Automating Releases with semantic-release
** install & canfigure semantic-release-cli
#+call: cmdaync("apt-get install libgnome-keyring-dev")
#+call: cmdaync("npm install -g semantic-release-cli")

#+RESULTS:
: command  is sended to /tmp/friends-aneesha

#+call: cmdaync("semantic-release-cli setup")
** install semantic-release
#+call: cmdaync("npm install -D semantic-release")

#+RESULTS:
: command  is sended to /tmp/friends-aneesha

** install commitizen and cz-conventional-changelog
#+call: cmdaync("npm install -D commitizen  cz-conventional-changelog")

#+RESULTS:
: command  is sended to /tmp/friends-aneesha
#+BEGIN_SRC sh
npm list commitizen  cz-conventional-changelog
#+END_SRC

#+RESULTS:
| friends-aneesha@1.4.0-beta.0 | /usr/local/src/microlibrary/friends-aneesha |                                 |
| ├─┬                          | commitizen@2.5.0                            |                                 |
| │                            | └──                                         | cz-conventional-changelog@1.1.4 |
| └──                          | cz-conventional-changelog@1.1.5             |                                 |
|                              |                                             |                                 |

#+BEGIN_SRC sh
ls -l node_modules/commitizen/bin/commitizen
#+END_SRC

#+RESULTS:
: -rwxr-xr-x 1 root root 49 Jan 10 09:02 node_modules/commitizen/bin/commitizen

#+call: cmdaync("node_modules/commitizen/bin/commitizen init cz-conventional-changelog --save --save-exact --force")

#+RESULTS:
: command  is sended to /tmp/friends-aneesha


** Update [[file:.travis.yml][Travis CI ]]
** commit git with npm
#+call: cmdaync("npm run commit")

#+RESULTS:
: command  is sended to /tmp/friends-aneesha
** Automatically running tests before commits with ghooks
#+BEGIN_SRC sh
npm i -D ghooks
#+END_SRC

#+RESULTS:
|                                          |                                             |                     |                                                                 |
| >                                        | ghooks@1.0.3                                | install             | /usr/local/src/microlibrary/friends-aneesha/node_modules/ghooks |
| >                                        | node                                        | ./bin/install       |                                                                 |
|                                          |                                             |                     |                                                                 |
| friends-aneesha@0.0.0-semanticly-release | /usr/local/src/microlibrary/friends-aneesha |                     |                                                                 |
| ├─┬                                      | ghooks@1.0.3                                |                     |                                                                 |
| │                                        | ├─┬                                         | findup@0.1.5        |                                                                 |
| │                                        | │                                           | ├──                 | colors@0.6.2                                                    |
| │                                        | │                                           | └──                 | commander@2.1.0                                                 |
| │                                        | ├─┬                                         | lodash.clone@3.0.3  |                                                                 |
| │                                        | │                                           | └─┬                 | lodash._baseclone@3.3.0                                         |
| │                                        | │                                           | ├──                 | lodash._arraycopy@3.0.0                                         |
| │                                        | │                                           | ├──                 | lodash._arrayeach@3.0.0                                         |
| │                                        | │                                           | └──                 | lodash._basefor@3.0.3                                           |
| │                                        | ├──                                         | manage-path@2.0.0   |                                                                 |
| │                                        | └──                                         | spawn-command@0.0.2 |                                                                 |
| └──                                      | unique-random-array@1.0.0                   |                     |                                                                 |
|                                          |                                             |                     |                                                                 |

#+BEGIN_EXAMPLE
**** /tmp/ediff25330ACK	2016-01-18 22:08:07.960000000 -0500
--- /tmp/ediff25330NMQ	2016-01-18 22:08:07.960000000 -0500
***************
**** 10,21 ****
--- 10,25 ----
      "chai": "3.4.1",
      "commitizen": "2.5.0",
      "cz-conventional-changelog": "1.1.5",
+     "ghooks": "1.0.3",
      "mocha": "2.3.4",
      "semantic-release": "^4.3.5"
    },
    "config": {
      "commitizen": {
        "path": "./node_modules/cz-conventional-changelog"
+     },
+     "ghooks": {
+       "pre-commit": "npm run test:single"
      }
    },
    "scripts": {
***************
**** 34,37 ****
    ],
    "author": "Chowdhury Ashraf",
    "license": "MIT"
! }
\ No newline at end of file
--- 38,41 ----
    ],
    "author": "Chowdhury Ashraf",
    "license": "MIT"
! }

#+END_EXAMPLE

#+NAME: npmcommit
#+BEGIN_SRC sh :noweb yes
<<cmdaync("npm run commit")>>
#+END_SRC

#+call: npmcommit()

#+RESULTS:
: nil
** Add new feature that returns array of random number

#+BEGIN_EXAMPLE
**** /tmp/ediff25330DRd	2016-01-18 16:26:52.536000000 -0500
--- /tmp/ediff25330Qbj	2016-01-18 16:26:52.540000000 -0500
***************
**** 1,8 ****
-
  var uniqueRandomArray = require('unique-random-array');
! var starWarsNames = require('./friends-names.json');

  module.exports = {
!   all: starWarsNames,
!   random: uniqueRandomArray(starWarsNames)
  };
--- 1,20 ----
  var uniqueRandomArray = require('unique-random-array');
! var nameOfFriendsOfAneesha = require('./friends-names.json');
! var getRandomItem = uniqueRandomArray(nameOfFriendsOfAneesha);
! var randomItems = [];

  module.exports = {
!   all: nameOfFriendsOfAneesha,
!   random: random
  };
+
+ function random(number){
+   if (number === undefined){
+     return getRandomItem();
+   }
+   if ( number > 0 ){
+     randomItems.push(getRandomItem());
+     return random( number - 1);
+   }
+   return randomItems;
+ }

#+END_EXAMPLE
#+BEGIN_EXAMPLE
**** /tmp/ediff25330QpL	2016-01-18 16:37:28.704000000 -0500
--- /tmp/ediff25330dzR	2016-01-18 16:37:28.704000000 -0500
***************
**** 21,25 ****
--- 21,33 ----
        var randomItem = friends.random();
        expect(friends.all).to.include(randomItem);
      });
+
+     it('should return an array of random items if passed a number', function() {
+       var randomItems = friends.random(3);
+       expect(randomItems).to.have.length(3);
+       randomItems.map(function(item) {
+         expect(friends.all).to.include(item);
+       });
+     });
    });
  });

#+END_EXAMPLE
*** run npm git
#+call: cmdaync("npm run commit")
*** and test:single
#+BEGIN_EXAMPLE
**** /tmp/ediff253305Js	2016-01-18 17:13:14.748000000 -0500
--- /tmp/ediff25330GUy	2016-01-18 17:13:14.752000000 -0500
***************
**** 12,17 ****
  before_script:
    - npm prune
  script:
!   - npm run test
  after_success:
    - npm run semantic-release
--- 12,17 ----
  before_script:
    - npm prune
  script:
!   - npm run test:single
  after_success:
    - npm run semantic-release

#+END_EXAMPLE
#+BEGIN_EXAMPLE
**** /tmp/ediff25330xuB	2016-01-18 21:46:12.580000000 -0500
--- /tmp/ediff25330-4H	2016-01-18 21:46:12.584000000 -0500
***************
**** 13,20 ****
      "mocha": "2.3.4",
      "semantic-release": "^4.3.5"
    },
!   "czConfig": {
!     "path": "node_modules/cz-conventional-changelog"
    },
    "scripts": {
      "commit": "git-cz",
--- 13,22 ----
      "mocha": "2.3.4",
      "semantic-release": "^4.3.5"
    },
!   "config": {
!     "commitizen": {
!       "path": "./node_modules/cz-conventional-changelog"
!     }
    },
    "scripts": {
      "commit": "git-cz",
***************
**** 32,35 ****
    ],
    "author": "Chowdhury Ashraf",
    "license": "MIT"
! }
--- 34,37 ----
    ],
    "author": "Chowdhury Ashraf",
    "license": "MIT"
! }
\ No newline at end of file

#+END_EXAMPLE
*** run npm git
#+call: cmdaync("npm run commit")

#+RESULTS:
: command  is sended to /tmp/friends-aneesha
* Adding code coverage recording with Istanbul
** Installation
#+call: cmdaync("npm install -D istanbul")

#+RESULTS:
: command  is sended to /tmp/friends-Ganesha

** Configuration diff
#+BEGIN_EXAMPLE
*** /tmp/ediff25330zdd	2016-01-19 08:17:56.912000000 -0500
--- /tmp/ediff25330Aoj	2016-01-19 08:17:56.920000000 -0500
***************
*** 26,32 ****
    "scripts": {
      "commit": "git-cz",
      "test": "mocha src/index.test.js -w",
!     "test:single": "mocha src/index.test.js",
      "semantic-release": "semantic-release pre && npm publish && semantic-release post"
    },
    "repository": {
--- 26,32 ----
    "scripts": {
      "commit": "git-cz",
      "test": "mocha src/index.test.js -w",
!     "test:single": "istanbul cover -x *.test.js _mocha -- -R spec src/index.test.js",
      "semantic-release": "semantic-release pre && npm publish && semantic-release post"
    },
    "repository": {

#+END_EXAMPLE

** test and commpit
#+call: cmdaync("npm run test:single")

#+RESULTS:
: command  is sended to /tmp/friends-aneesha

#+call: readme()

#+RESULTS:
: nil

#+call: cmdaync("npm run commit")
** Add coverage checking
#+call: cmdaync("npm run test:single")
#+call: cmdaync("npm run check-coverage")

#+BEGIN_EXAMPLE
*** /tmp/ediff253304p0	2016-01-19 10:09:50.384000000 -0500
--- /tmp/ediff25330qzD	2016-01-19 10:09:50.384000000 -0500
***************
*** 18,20 ****
--- 18,24 ----
    }
    return randomItems;
  }
+
+ function doSomethings() {
+   console.log('hi');
+ }

#+END_EXAMPLE

#+call: cmdaync("npm run test:single")
#+call: cmdaync("npm run check-coverage")
#+RESULTS:
: command  is sended to /tmp/friends-Ganesha
#+call: cmdaync("npm run commit")
#+RESULTS:
: command  is sended to /tmp/friends-aneesha
* New feature *pair*
#+call: readme()
#+call: cmdaync("npm run commit")

#+RESULTS:
: command  is sended to /tmp/friends-aneesha
* codecov.io
  #+call: cmdaync("npm install -D codecov.io")
**************** add configuration
#+BEGIN_EXAMPLE
*** /tmp/ediff17310uWU	2016-01-19 14:30:07.176000000 -0500
--- /tmp/ediff173107ga	2016-01-19 14:30:07.180000000 -0500
***************
*** 8,13 ****
--- 8,14 ----
    },
    "devDependencies": {
      "chai": "3.4.1",
+     "codecov.io": "0.1.6",
      "commitizen": "2.5.0",
      "cz-conventional-changelog": "1.1.5",
      "ghooks": "1.0.3",
***************
*** 30,35 ****
--- 31,37 ----
      "test:single": "istanbul cover -x *.test.js _mocha -- -R spec src/index.test.js",
      "semantic-release": "semantic-release pre && npm publish && semantic-release post",
      "check-coverage": "istanbul check-coverage --statements 100 --branches 100 --functions 100 --lines 100"
+     "report-coverage": "cat ./coverage/lcov.info | codecov"
    },
    "repository": {
      "type": "git",

#+END_EXAMPLE
#+BEGIN_EXAMPLE
@@ -15,6 +15,7 @@ script:
   - npm run test:single
   - npm run check-coverage
 after_success:
+  - npm run report-coverage
   - npm run semantic-release
 branches:
   except:
#+END_EXAMPLE
* feat(pair): make circular pair with mod.

closes #4 BREAKING CHANGE: sequential to circular pair

**************** code
#+BEGIN_EXAMPLE
@@ -22,7 +22,7 @@ function random(number){

 function pair(n) {
   var sequence = [];
-  sequence[0] = nameOfFriendsOfAneesha[n-1];
-  sequence[1] = nameOfFriendsOfAneesha[n];
+  sequence[0] = nameOfFriendsOfAneesha[ (n -1 ) % nameOfFriendsOfAneesha.length ];
+  sequence[1] = nameOfFriendsOfAneesha[ n % nameOfFriendsOfAneesha.length ];
   return sequence;
 }

#+END_EXAMPLE
#+BEGIN_EXAMPLE
@@ -40,5 +40,11 @@ describe('firends-anneesha', function() {
       expect(friendshipSequece1[0]).is.equal("Liana")
       expect(friendshipSequece1[1]).is.equal("Asia")
     });
+
+    it('should return circular', function() {
+      var friendshipSequece = friends.pair(13);
+      expect(friendshipSequece[0]).is.equal("Bandhan");
+      expect(friendshipSequece[1]).is.equal("Aneesha");
+    } );
   });
 });


#+END_EXAMPLE
* update tag
  #+call: cmdaync("git fetch origin master --tags")

#+RESULTS:
: command  is sended to /tmp/friends-aneesha
